src/integ-test/bdd-test/features/flows/TestFlusso_closePaymentV2_ok_SPO_ok_SPR_ok_multipleTokens

Feature:  flow checks for sendPaymentResult-v2 request - closePayment-v2 OK, sendPaymentOutcome-v2 OK, sendPaymentResult-v2 OK, multipleTokens [FLUSSO_SPR_02]
 
  Background:
    Given systems up 
    And EC new version
    
    # checkPosition phase
    Scenario: Execute checkPosition request
    Given initial json checkPosition
    
    """
    {"positionslist": [
    {"fiscalCode": "77777777777", 
    "noticeNumber": "310016541303178100"}
    ]
    }
    """
    
    When PM sends checkPosition to nodo-dei-pagamenti
    Then check outcome is OK of checkPosition response
    And check errorCode is 200 of checkPosition response
    
   # activatePaymentNoticeV2 phase
    Scenario: Execute activatePaymentNoticeV2 request
    Given stazione with STAZIONI.VERSIONE_PRIMITIVE = 2
    And initial XML activatePaymentNoticeV2 soap-request
	
    """
    <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nod="http://pagopa-api.pagopa.gov.it/node/nodeForPsp.xsd">
       <soapenv:Header/>
       <soapenv:Body>
          <nod:activatePaymentNoticeV2Request>
             <idPSP>70000000001</idPSP>
             <idBrokerPSP>70000000001</idBrokerPSP>
             <idChannel>70000000001_01</idChannel>
             <password>pwdpwdpwd</password>
             <idempotencyKey>#idempotency_key#</idempotencyKey>
             <qrCode>
                <fiscalCode>#creditor_institution_code#</fiscalCode>
                <noticeNumber>#notice_number#</noticeNumber>
             </qrCode>
             <!--expirationTime>60000</expirationTime-->
             <amount>10.00</amount>
             <paymentNote>responseFull</paymentNote>
          </nod:activatePaymentNoticeV2Request>
       </soapenv:Body>
    </soapenv:Envelope>
    """
        
    When psp sends SOAP activatePaymentNoticeV2 to nodo-dei-pagamenti
    Then check outcome is OK of activatePaymentNoticeV2 response
    
    # activatePaymentNoticeV2 phase 1
    Scenario: Execute activatePaymentNoticeV2 request
    Given initial XML activatePaymentNoticeV2 soap-request
	
    """
    <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nod="http://pagopa-api.pagopa.gov.it/node/nodeForPsp.xsd">
       <soapenv:Header/>
       <soapenv:Body>
          <nod:activatePaymentNoticeV2Request>
             <idPSP>70000000001</idPSP>
             <idBrokerPSP>70000000001</idBrokerPSP>
             <idChannel>70000000001_01</idChannel>
             <password>pwdpwdpwd</password>
             <idempotencyKey>#idempotency_key_1#</idempotencyKey>
             <qrCode>
                <fiscalCode>#creditor_institution_code#</fiscalCode>
                <noticeNumber>#notice_number_1#</noticeNumber>
             </qrCode>
             <!--expirationTime>60000</expirationTime-->
             <amount>10.00</amount>
             <paymentNote>responseFull</paymentNote>
          </nod:activatePaymentNoticeV2Request>
       </soapenv:Body>
    </soapenv:Envelope>
    """
        
    When psp sends SOAP activatePaymentNoticeV2 to nodo-dei-pagamenti
    Then check outcome is OK of activatePaymentNoticeV2 response
     
    # closePayment-v2 phase  
    Scenario: Execute a closePayment-v2 request
    Given idChannel with CANALI_NODO.VERSIONE_PRIMITIVE = 2
    And initial json closePayment-v2
    """   
    {"paymentTokens": [
        "$activatePaymentNoticeV2Response.paymentToken",
        "$activatePaymentNoticeV2-1Response.paymentToken"
        ],
    "outcome": "OK",
    "idPSP": "70000000001",
    "idBrokerPSP": "70000000001",
    "idChannel": "70000000001_08",
    "paymentMethod": "TPAY",
    "transactionId": "19392562",
    "totalAmount": 22.00,
    "fee": 2.00,
    "timestampOperation": "2033-04-23T18:25:43Z",
    "additionalPaymentInformations": {
          "key": "10793459"
        }
    }
    """

    When PM sends closePayment-v2 to nodo-dei-pagamenti
    Then check esito is OK 
    And check errorCode is 200
 
        
    # sendPaymentOutcome-v2 phase
     Scenario: Execute sendPaymentOutcome-v2 request
     Given the closePayment-v2 scenario executed successfully
     Given initial XML sendPaymentOutcome-v2
     """
     <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nod="http://pagopa-api.pagopa.gov.it/node/nodeForPsp.xsd">
       <soapenv:Header/>
       <soapenv:Body>
          <nod:sendPaymentOutcomeV2Request>
             <idPSP>70000000001</idPSP>
             <idBrokerPSP>70000000001</idBrokerPSP>
             <idChannel>70000000001_01</idChannel>
             <password>pwdpwdpwd</password>
             <paymentTokens>
                <paymentToken>$activatePaymentNoticeV2Response.paymentToken</paymentToken>
                <paymentToken>$activatePaymentNoticeV2-1Response.paymentToken</paymentToken>
             </paymentTokens>
             <outcome>OK</outcome>
             <!--Optional:-->
             <details>
                <paymentMethod>creditCard</paymentMethod>
                <!--Optional:-->
                <paymentChannel>app</paymentChannel>
                <fee>2.00</fee>
                <!--Optional:-->
                <payer>
                   <uniqueIdentifier>
                      <entityUniqueIdentifierType>G</entityUniqueIdentifierType>
                      <entityUniqueIdentifierValue>77777777777_01</entityUniqueIdentifierValue>
                   </uniqueIdentifier>
                   <fullName>name</fullName>
                   <!--Optional:-->
                   <streetName>street</streetName>
                   <!--Optional:-->
                   <civicNumber>civic</civicNumber>
                   <!--Optional:-->
                   <postalCode>postal</postalCode>
                   <!--Optional:-->
                   <city>city</city>
                   <!--Optional:-->
                   <stateProvinceRegion>state</stateProvinceRegion>
                   <!--Optional:-->
                   <country>IT</country>
                   <!--Optional:-->
                   <e-mail>prova@test.it</e-mail>
                </payer>
                <applicationDate>2021-12-12</applicationDate>
                <transferDate>2021-12-11</transferDate>
             </details>
          </nod:sendPaymentOutcomeV2Request>
       </soapenv:Body>
    </soapenv:Envelope>
    """
     
    When psp sends sendPaymentOutcome-v2 to nodo-dei-pagamenti
    Then check outcome is OK
    And check sendPaymentResult-v2 is sent to PM
    And check sendPaymentResult-v2 contains all required fields
    """
    {
    "paymentTokens":[
        "$activatePaymentNoticeV2Response.paymentToken",
        "$activatePaymentNoticeV2-1Response.paymentToken"
        ],
    "transactionId":"13609451",
    "outcome":"OK"
    }             
    """
    And check sendPaymentResult-v2 response contains {"esito": "OK"}
    
    
    # DB check - RE
    # SELECT S.* FROM RE S WHERE S.PAYMENT_TOKEN = '$activatePaymentNoticeV2Response.paymentToken' AND S.TIPO_EVENTO = 'sendPaymentResult-v2' order by s.DATA_ORA_EVENTO asc;
    
    # ID != null 
    # DATA_ORA_EVENTO != null
    # IDENTIFICATIVO_DOMINIO == #creditor_institution_code#
    # IDENTIFICATIVO_UNIVOCO_VERSAMENTO == #iuv#
    # CODICE_CONTESTO_PAGAMENTO == '$activatePaymentNoticeV2Response.paymentToken'
    # IDENTIFICATIVO_PRESTATORE_SERVIZI_PAGAMENTO == POSITION_PAYMENT.psp
    # TIPO_VERSAMENTO == null
    # COMPONENTE == 'FESP'
    # CATEGORIA_EVENTO == 'INTERFACCIA'
    # TIPO_EVENTO == 'sendPaymentResult-v2'
    # SOTTO_TIPO_EVENTO == 'REQ'
    # IDENTIFICATIVO_FRUITORE == 'NodoDeiPagamentiSPC'
    # IDENTIFICATIVO_EROGATORE == 'PM'
    # IDENTIFICATIVO_STAZIONE_INTERMEDIARIO_PA == POSITION_PAYMENT.station_id
    # CANALE_PAGAMENTO == POSITION_PAYMENT.chanel_id
    # PARAMETRI_SPECIFICI_INTERFACCIA == null
    # ESITO == 'INVIATA'
    # ID_SESSIONE != null
    # STATUS == null
    # PAYLOAD == blob
    # INFO == 'http://172.31.251.182:9087/v2/sendpaymentresult'
    # INSERTED_TIMESTAMP != null
    # BUSINESS_PROCESS == 'sendPaymentOutcomeV2'
    # FRUITORE_DESCR == 'NodoDeiPagamentiSPC'
    # EROGATORE_DESCR == 'PM'
    # PSP_DESCR == null
    # NOTICE_ID == #notice_number#
    # CREDITOR_REFERENCE_ID == #iuv#
    # PAYMENT_TOKEN == '$activatePaymentNoticeV2Response.paymentToken'
    # ID_SESSIONE_ORIGINALE == '$activatePaymentNoticeV2Response.paymentToken'
    # ID_EVENTHUB != null
    
    # ID != null 
    # DATA_ORA_EVENTO != null
    # IDENTIFICATIVO_DOMINIO == #creditor_institution_code#
    # IDENTIFICATIVO_UNIVOCO_VERSAMENTO == #iuv#
    # CODICE_CONTESTO_PAGAMENTO == '$activatePaymentNoticeV2Response.paymentToken'
    # IDENTIFICATIVO_PRESTATORE_SERVIZI_PAGAMENTO == POSITION_PAYMENT.psp
    # TIPO_VERSAMENTO == null
    # COMPONENTE == 'FESP'
    # CATEGORIA_EVENTO == 'INTERFACCIA'
    # TIPO_EVENTO == 'sendPaymentResult-v2'
    # SOTTO_TIPO_EVENTO == 'RESP'
    # IDENTIFICATIVO_FRUITORE == 'NodoDeiPagamentiSPC'
    # IDENTIFICATIVO_EROGATORE == 'PM'
    # IDENTIFICATIVO_STAZIONE_INTERMEDIARIO_PA == POSITION_PAYMENT.station_id
    # CANALE_PAGAMENTO == POSITION_PAYMENT.chanel_id
    # PARAMETRI_SPECIFICI_INTERFACCIA == null
    # ESITO == 'RICEVUTA'
    # ID_SESSIONE != null
    # STATUS == null
    # PAYLOAD == blob
    # INFO == 'http://172.31.251.182:9087/v2/sendpaymentresult'
    # INSERTED_TIMESTAMP != null
    # BUSINESS_PROCESS == 'sendPaymentOutcomeV2'
    # FRUITORE_DESCR == 'NodoDeiPagamentiSPC'
    # EROGATORE_DESCR == 'PM'
    # PSP_DESCR == null
    # NOTICE_ID == #notice_number#
    # CREDITOR_REFERENCE_ID == #iuv#
    # PAYMENT_TOKEN == '$activatePaymentNoticeV2Response.paymentToken'
    # ID_SESSIONE_ORIGINALE == '$activatePaymentNoticeV2Response.paymentToken'
    # ID_EVENTHUB != null